#Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
#Пример:
#- [2, 3, 4, 5, 6] => [12, 15, 16];
#- [2, 3, 5, 6] => [12, 15]
a,b=[2, 3, 4, 5, 6,2,1],[2, 3, 5, 6,2,2,3,4]
def Spike(a=[]):
        k=0

        while len(a)/2>k:
            print(a[k]*a[-k-1])
            k+=1


Spike(a)